cases/FlowInPoreSpace/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "2/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          238;
        startFace       44872;
    }
    left
    {
        type            patch;
        nFaces          100;
        startFace       45110;
    }
    right
    {
        type            patch;
        nFaces          100;
        startFace       45210;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          203;
        startFace       45310;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          47674;
        startFace       45513;
    }
    fixedWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3741;
        startFace       93187;
    }
)

// ************************************************************************* //
