cases/FlowInPoreSpace/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

simpleFoam > log
